alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4300_series/Include/XMC4300.h
typedef struct {                                    /*!< (@ 0x54010000) ECAT Structure                                         */
  __I  uint8_t   TYPE;                              /*!< (@ 0x54010000) Type of EtherCAT Controller                            */
  __I  uint8_t   REVISION;                          /*!< (@ 0x54010001) Revision of EtherCAT Controller                        */
  __I  uint16_t  BUILD;                             /*!< (@ 0x54010002) Build Version                                          */
  __I  uint8_t   FMMU_NUM;                          /*!< (@ 0x54010004) FMMUs Supported                                        */
  __I  uint8_t   SYNC_MANAGER;                      /*!< (@ 0x54010005) SyncManagers Supported                                 */
  __I  uint8_t   RAM_SIZE;                          /*!< (@ 0x54010006) RAM Size                                               */
  __I  uint8_t   PORT_DESC;                         /*!< (@ 0x54010007) Port Descriptor                                        */
  __I  uint16_t  FEATURE;                           /*!< (@ 0x54010008) ESC Features Supported                                 */
  __I  uint16_t  RESERVED[3];
  __I  uint16_t  STATION_ADR;                       /*!< (@ 0x54010010) Configured Station Address                             */
  __IO uint16_t  STATION_ALIAS;                     /*!< (@ 0x54010012) Configured Station Alias                               */
  __I  uint32_t  RESERVED1[3];
  __I  uint8_t   WR_REG_ENABLE;                     /*!< (@ 0x54010020) Write Register Enable                                  */
  __I  uint8_t   WR_REG_PROTECT;                    /*!< (@ 0x54010021) Write Register Protection                              */
  __I  uint16_t  RESERVED2[7];
  __I  uint8_t   ESC_WR_ENABLE;                     /*!< (@ 0x54010030) ESC Write Enable                                       */
  __I  uint8_t   ESC_WR_PROTECT;                    /*!< (@ 0x54010031) ESC Write Protection                                   */
  __I  uint16_t  RESERVED3[7];
  
  union {
    __I  uint8_t   ESC_RESET_ECAT_READMode;         /*!< (@ 0x54010040) ESC Reset ECAT [READ Mode]                             */
    __I  uint8_t   ESC_RESET_ECAT_WRITEMode;        /*!< (@ 0x54010040) ESC Reset ECAT [WRITE Mode]                            */
  };
  
  union {
    __I  uint8_t   ESC_RESET_PDI_READMode;          /*!< (@ 0x54010041) ESC Reset PDI [READ Mode]                              */
    __I  uint8_t   ESC_RESET_PDI_WRITEMode;         /*!< (@ 0x54010041) ESC Reset PDI [WRITE Mode]                             */
  };
  __I  uint16_t  RESERVED4[95];
  __I  uint32_t  ESC_DL_CONTROL;                    /*!< (@ 0x54010100) ESC DL Control                                         */
  __I  uint32_t  RESERVED5;
  __I  uint16_t  PHYSICAL_RW_OFFSET;                /*!< (@ 0x54010108) Physical Read/Write Offset                             */
  __I  uint16_t  RESERVED6[3];
  __I  uint16_t  ESC_DL_STATUS;                     /*!< (@ 0x54010110) ESC DL Status                                          */
  __I  uint16_t  RESERVED7[7];
  __I  uint16_t  AL_CONTROL;                        /*!< (@ 0x54010120) AL Control                                             */
  __I  uint16_t  RESERVED8[7];
  __IO uint16_t  AL_STATUS;                         /*!< (@ 0x54010130) AL Status                                              */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  AL_STATUS_CODE;                    /*!< (@ 0x54010134) AL Status Code                                         */
  __I  uint16_t  RESERVED10;
  __IO uint8_t   RUN_LED;                           /*!< (@ 0x54010138) RUN LED Override                                       */
  __IO uint8_t   ERR_LED;                           /*!< (@ 0x54010139) RUN ERR Override                                       */
  __I  uint16_t  RESERVED11[3];
  __I  uint8_t   PDI_CONTROL;                       /*!< (@ 0x54010140) PDI Control                                            */
  __I  uint8_t   ESC_CONFIG;                        /*!< (@ 0x54010141) ESC Configuration                                      */
  __I  uint16_t  RESERVED12[7];
  __I  uint8_t   PDI_CONFIG;                        /*!< (@ 0x54010150) PDI Control                                            */
  __I  uint8_t   SYNC_LATCH_CONFIG;                 /*!< (@ 0x54010151) Sync/Latch[1:0] PDI Configuration                      */
  __I  uint16_t  PDI_EXT_CONFIG;                    /*!< (@ 0x54010152) PDI Synchronous Microcontroller extended Configuration */
  __I  uint32_t  RESERVED13[43];
  __I  uint16_t  EVENT_MASK;                        /*!< (@ 0x54010200) ECAT Event Mask                                        */
  __I  uint16_t  RESERVED14;
  __IO uint32_t  AL_EVENT_MASK;                     /*!< (@ 0x54010204) PDI AL Event Mask                                      */
  __I  uint32_t  RESERVED15[2];
  __I  uint16_t  EVENT_REQ;                         /*!< (@ 0x54010210) ECAT Event Request                                     */
  __I  uint16_t  RESERVED16[7];
  __IO uint32_t  AL_EVENT_REQ;                      /*!< (@ 0x54010220) AL Event Request                                       */
  __I  uint32_t  RESERVED17[55];
  __I  uint16_t  RX_ERR_COUNT0;                     /*!< (@ 0x54010300) RX Error Counter Port 0                                */
  __I  uint16_t  RX_ERR_COUNT1;                     /*!< (@ 0x54010302) RX Error Counter Port 1                                */
  __I  uint32_t  RESERVED18;
  __I  uint8_t   FWD_RX_ERR_COUNT0;                 /*!< (@ 0x54010308) Forwarded RX Error Counter Port 0                      */
  __I  uint8_t   FWD_RX_ERR_COUNT1;                 /*!< (@ 0x54010309) Forwarded RX Error Counter Port 1                      */
  __I  uint16_t  RESERVED19;
  __I  uint8_t   PROC_ERR_COUNT;                    /*!< (@ 0x5401030C) ECAT Processing Unit Error Counter                     */
  __I  uint8_t   PDI_ERR_COUNT;                     /*!< (@ 0x5401030D) PDI Error Counter                                      */
  __I  uint16_t  RESERVED20;
  __I  uint8_t   LOST_LINK_COUNT0;                  /*!< (@ 0x54010310) Lost Link Counter Port 0                               */
  __I  uint8_t   LOST_LINK_COUNT1;                  /*!< (@ 0x54010311) Lost Link Counter Port 1                               */
  __I  uint16_t  RESERVED21[119];
  __IO uint16_t  WD_DIVIDE;                         /*!< (@ 0x54010400) Watchdog Divider                                       */
  __I  uint16_t  RESERVED22[7];
  __IO uint16_t  WD_TIME_PDI;                       /*!< (@ 0x54010410) Watchdog Time PDI                                      */
  __I  uint16_t  RESERVED23[7];
  __IO uint16_t  WD_TIME_PDATA;                     /*!< (@ 0x54010420) Watchdog Time Process Data                             */
  __I  uint16_t  RESERVED24[15];
  __I  uint16_t  WD_STAT_PDATA;                     /*!< (@ 0x54010440) Watchdog Status Process Data                           */
  __I  uint8_t   WD_COUNT_PDATA;                    /*!< (@ 0x54010442) Watchdog Counter Process Data                          */
  __I  uint8_t   WD_COUNT_PDI;                      /*!< (@ 0x54010443) Watchdog Counter PDI                                   */
  __I  uint32_t  RESERVED25[47];
  __I  uint8_t   EEP_CONF;                          /*!< (@ 0x54010500) EEPROM Configuration                                   */
  __IO uint8_t   EEP_STATE;                         /*!< (@ 0x54010501) EEPROM PDI Access State                                */
  __IO uint16_t  EEP_CONT_STAT;                     /*!< (@ 0x54010502) EEPROM Control/Status                                  */
  __IO uint32_t  EEP_ADR;                           /*!< (@ 0x54010504) EEPROM Address                                         */
  __IO uint32_t  EEP_DATA[2];                       /*!< (@ 0x54010508) EEPROM Read/Write data                                 */
  __IO uint16_t  MII_CONT_STAT;                     /*!< (@ 0x54010510) MII Management Control/Status                          */
  __IO uint8_t   MII_PHY_ADR;                       /*!< (@ 0x54010512) PHY Address                                            */
  __IO uint8_t   MII_PHY_REG_ADR;                   /*!< (@ 0x54010513) PHY Register Address                                   */
  __IO uint16_t  MII_PHY_DATA;                      /*!< (@ 0x54010514) PHY Data                                               */
  __I  uint8_t   MII_ECAT_ACS_STATE;                /*!< (@ 0x54010516) MII ECAT ACS STATE                                     */
  __IO uint8_t   MII_PDI_ACS_STATE;                 /*!< (@ 0x54010517) MII PDI ACS STATE                                      */
  __I  uint32_t  RESERVED26[250];
  __I  uint32_t  DC_RCV_TIME_PORT0;                 /*!< (@ 0x54010900) Receive Time Port 0                                    */
  __I  uint32_t  DC_RCV_TIME_PORT1;                 /*!< (@ 0x54010904) Receive Time Port 1                                    */
  __I  uint32_t  RESERVED27[2];
  
  union {
    __I  uint32_t  READMode_DC_SYS_TIME[2];         /*!< (@ 0x54010910) System Time read access                                */
    __O  uint32_t  DC_SYS_TIME_WRITEMode;           /*!< (@ 0x54010910) System Time [WRITE Mode]                               */
  };
  __I  uint32_t  RECEIVE_TIME_PU[2];                /*!< (@ 0x54010918) Local time of the beginning of a frame                 */
  __IO uint32_t  DC_SYS_TIME_OFFSET[2];             /*!< (@ 0x54010920) Difference between local time and System Time          */
  __IO uint32_t  DC_SYS_TIME_DELAY;                 /*!< (@ 0x54010928) System Time Delay                                      */
  __I  uint32_t  DC_SYS_TIME_DIFF;                  /*!< (@ 0x5401092C) System Time Difference                                 */
  __IO uint16_t  DC_SPEED_COUNT_START;              /*!< (@ 0x54010930) Speed Counter Start                                    */
  __I  uint16_t  DC_SPEED_COUNT_DIFF;               /*!< (@ 0x54010932) Speed Counter Diff                                     */
  __IO uint8_t   DC_SYS_TIME_FIL_DEPTH;             /*!< (@ 0x54010934) System Time Difference Filter Depth                    */
  __IO uint8_t   DC_SPEED_COUNT_FIL_DEPTH;          /*!< (@ 0x54010935) Speed Counter Filter Depth                             */
  __I  uint16_t  RESERVED28[37];
  __I  uint8_t   DC_CYC_CONT;                       /*!< (@ 0x54010980) Cyclic Unit Control                                    */
  __IO uint8_t   DC_ACT;                            /*!< (@ 0x54010981) Activation register                                    */
  __I  uint16_t  DC_PULSE_LEN;                      /*!< (@ 0x54010982) Pulse Length of SyncSignals                            */
  __I  uint8_t   DC_ACT_STAT;                       /*!< (@ 0x54010984) Activation Status                                      */
  __I  uint8_t   RESERVED29[9];
  __I  uint8_t   DC_SYNC0_STAT;                     /*!< (@ 0x5401098E) SYNC0 Status                                           */
  __I  uint8_t   DC_SYNC1_STAT;                     /*!< (@ 0x5401098F) SYNC1 Status                                           */
  __IO uint32_t  DC_CYC_START_TIME[2];              /*!< (@ 0x54010990) Start Time Cyclic Operation                            */
  __I  uint32_t  DC_NEXT_SYNC1_PULSE[2];            /*!< (@ 0x54010998) System time of next SYNC1 pulse in ns                  */
  __IO uint32_t  DC_SYNC0_CYC_TIME;                 /*!< (@ 0x540109A0) SYNC0 Cycle Time                                       */
  __IO uint32_t  DC_SYNC1_CYC_TIME;                 /*!< (@ 0x540109A4) SYNC1 Cycle Time                                       */
  __IO uint8_t   DC_LATCH0_CONT;                    /*!< (@ 0x540109A8) Latch0 Control                                         */
  __IO uint8_t   DC_LATCH1_CONT;                    /*!< (@ 0x540109A9) Latch1 Control                                         */
  __I  uint32_t  RESERVED30;
  __I  uint8_t   DC_LATCH0_STAT;                    /*!< (@ 0x540109AE) Latch0 Status                                          */
  __I  uint8_t   DC_LATCH1_STAT;                    /*!< (@ 0x540109AF) Latch1 Status                                          */
  __I  uint32_t  DC_LATCH0_TIME_POS[2];             /*!< (@ 0x540109B0) Register captures System time at the positive
                                                         edge of the Latch0 signal                                             */
  __I  uint32_t  DC_LATCH0_TIME_NEG[2];             /*!< (@ 0x540109B8) Register captures System time at the negative
                                                         edge of the Latch0 signal                                             */
  __I  uint32_t  DC_LATCH1_TIME_POS[2];             /*!< (@ 0x540109C0) Register captures System time at the positive
                                                         edge of the Latch1 signal                                             */
  __I  uint32_t  DC_LATCH1_TIME_NEG[2];             /*!< (@ 0x540109C8) Register captures System time at the negative
                                                         edge of the Latch1 signal                                             */
  __I  uint32_t  RESERVED31[8];
  __I  uint32_t  DC_ECAT_CNG_EV_TIME;               /*!< (@ 0x540109F0) EtherCAT Buffer Change Event Time                      */
  __I  uint32_t  RESERVED32;
  __I  uint32_t  DC_PDI_START_EV_TIME;              /*!< (@ 0x540109F8) PDI Buffer Start Event Time                            */
  __I  uint32_t  DC_PDI_CNG_EV_TIME;                /*!< (@ 0x540109FC) PDI Buffer Change Event Time                           */
  __I  uint32_t  RESERVED33[256];
  __I  uint32_t  ID;                                /*!< (@ 0x54010E00) ECAT0 Module ID                                        */
  __I  uint32_t  RESERVED34;
  __I  uint32_t  STATUS;                            /*!< (@ 0x54010E08) ECAT0 Status                                           */
} ECAT_Type;


/* ================================================================================ */
/* ================            ECAT0_FMMU [ECAT0_FMMU0]            ================ */
/* ================================================================================ */


/**
  * @brief EtherCAT 0 (ECAT0_FMMU)
  */

typedef struct {                                    /*!< (@ 0x54010600) ECAT0_FMMU Structure                                   */
  __I  uint32_t  FMMU_L_START_ADR;                  /*!< (@ 0x54010600) Logical Start address FMMU                             */
  __I  uint16_t  FMMU_LEN;                          /*!< (@ 0x54010604) Length FMMU 0                                          */
  __I  uint8_t   FMMU_L_START_BIT;                  /*!< (@ 0x54010606) Start bit FMMU 0 in logical address space              */
  __I  uint8_t   FMMU_L_STOP_BIT;                   /*!< (@ 0x54010607) Stop bit FMMU 0 in logical address space               */
  __I  uint16_t  FMMU_P_START_ADR;                  /*!< (@ 0x54010608) Ph0sical Start address FMMU y                          */
  __I  uint8_t   FMMU_P_START_BIT;                  /*!< (@ 0x5401060A) Ph0sical Start bit FMMU y                              */
  __I  uint8_t   FMMU_TYPE;                         /*!< (@ 0x5401060B) T0pe FMMU y                                            */
  __I  uint8_t   FMMU_ACT;                          /*!< (@ 0x5401060C) Activate FMMU 0                                        */
} ECAT0_FMMU_Type;


/* ================================================================================ */
/* ================              ECAT0_SM [ECAT0_SM0]              ================ */
/* ================================================================================ */


/**
  * @brief EtherCAT 0 (ECAT0_SM)
  */

typedef struct {                                    /*!< (@ 0x54010800) ECAT0_SM Structure                                     */
  __I  uint16_t  SM_P_START_ADR;                    /*!< (@ 0x54010800) Physical Start Address SyncManager 0                   */
  __I  uint16_t  SM_LEN;                            /*!< (@ 0x54010802) Length SyncManager 0                                   */
  __I  uint8_t   SM_CONTROL;                        /*!< (@ 0x54010804) Control Register SyncManager 0                         */
  __I  uint8_t   SM_STATUS;                         /*!< (@ 0x54010805) Status Register SyncManager 0                          */
  __I  uint8_t   SM_ACT;                            /*!< (@ 0x54010806) Activate SyncManager 0                                 */
  __IO uint8_t   SM_PDI_CTR;                        /*!< (@ 0x54010807) PDI Control SyncManager 0                              */
} ECAT0_SM_Type;


/* ================================================================================ */
/* ================                   USB [USB0]                   ================ */
/* ================================================================================ */


/**
  * @brief Universal Serial Bus (USB)
  */

typedef struct {                                    /*!< (@ 0x50040000) USB Structure                                          */
  __IO uint32_t  GOTGCTL;                           /*!< (@ 0x50040000) Control and Status Register                            */
  __IO uint32_t  GOTGINT;                           /*!< (@ 0x50040004) OTG Interrupt Register                                 */
  __IO uint32_t  GAHBCFG;                           /*!< (@ 0x50040008) AHB Configuration Register                             */
  __IO uint32_t  GUSBCFG;                           /*!< (@ 0x5004000C) USB Configuration Register                             */
  __IO uint32_t  GRSTCTL;                           /*!< (@ 0x50040010) Reset Register                                         */
  
  union {
    __IO uint32_t  GINTSTS_DEVICEMODE;              /*!< (@ 0x50040014) Interrupt Register [DEVICEMODE]                        */
    __IO uint32_t  GINTSTS_HOSTMODE;                /*!< (@ 0x50040014) Interrupt Register [HOSTMODE]                          */
  };
  
  union {
    __IO uint32_t  GINTMSK_DEVICEMODE;              /*!< (@ 0x50040018) Interrupt Mask Register [DEVICEMODE]                   */
    __IO uint32_t  GINTMSK_HOSTMODE;                /*!< (@ 0x50040018) Interrupt Mask Register [HOSTMODE]                     */
  };
  
  union {
    __I  uint32_t  GRXSTSR_DEVICEMODE;              /*!< (@ 0x5004001C) Receive Status Debug Read Register [DEVICEMODE]        */
    __I  uint32_t  GRXSTSR_HOSTMODE;                /*!< (@ 0x5004001C) Receive Status Debug Read Register [HOSTMODE]          */
  };
  
  union {
    __I  uint32_t  GRXSTSP_HOSTMODE;                /*!< (@ 0x50040020) Receive Status Read and Pop Register [HOSTMODE]        */
    __I  uint32_t  GRXSTSP_DEVICEMODE;              /*!< (@ 0x50040020) Receive Status Read and Pop Register [DEVICEMODE]      */
  };
  __IO uint32_t  GRXFSIZ;                           /*!< (@ 0x50040024) Receive FIFO Size Register                             */
  
  union {
    __IO uint32_t  GNPTXFSIZ_DEVICEMODE;            /*!< (@ 0x50040028) Non-Periodic Transmit FIFO Size Register [DEVICEMODE]  */
    __IO uint32_t  GNPTXFSIZ_HOSTMODE;              /*!< (@ 0x50040028) Non-Periodic Transmit FIFO Size Register [HOSTMODE]    */
  };
  __I  uint32_t  GNPTXSTS;                          /*!< (@ 0x5004002C) Non-Periodic Transmit FIFO/Queue Status Register       */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  GUID;                              /*!< (@ 0x5004003C) USB Module Identification Register                     */
  __I  uint32_t  RESERVED1[7];
  __IO uint32_t  GDFIFOCFG;                         /*!< (@ 0x5004005C) Global DFIFO Software Config Register                  */
  __I  uint32_t  RESERVED2[40];
  __IO uint32_t  HPTXFSIZ;                          /*!< (@ 0x50040100) Host Periodic Transmit FIFO Size Register              */
  __IO uint32_t  DIEPTXF1;                          /*!< (@ 0x50040104) Device IN Endpoint Transmit FIFO Size Register         */
  __IO uint32_t  DIEPTXF2;                          /*!< (@ 0x50040108) Device IN Endpoint Transmit FIFO Size Register         */
  __IO uint32_t  DIEPTXF3;                          /*!< (@ 0x5004010C) Device IN Endpoint Transmit FIFO Size Register         */
  __IO uint32_t  DIEPTXF4;                          /*!< (@ 0x50040110) Device IN Endpoint Transmit FIFO Size Register         */
  __IO uint32_t  DIEPTXF5;                          /*!< (@ 0x50040114) Device IN Endpoint Transmit FIFO Size Register         */
  __IO uint32_t  DIEPTXF6;                          /*!< (@ 0x50040118) Device IN Endpoint Transmit FIFO Size Register         */
  __I  uint32_t  RESERVED3[185];
  __IO uint32_t  HCFG;                              /*!< (@ 0x50040400) Host Configuration Register                            */
  __IO uint32_t  HFIR;                              /*!< (@ 0x50040404) Host Frame Interval Register                           */
  __IO uint32_t  HFNUM;                             /*!< (@ 0x50040408) Host Frame Number/Frame Time Remaining Register        */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  HPTXSTS;                           /*!< (@ 0x50040410) Host Periodic Transmit FIFO/ Queue Status Register     */
  __I  uint32_t  HAINT;                             /*!< (@ 0x50040414) Host All Channels Interrupt Register                   */
  __IO uint32_t  HAINTMSK;                          /*!< (@ 0x50040418) Host All Channels Interrupt Mask Register              */
  __IO uint32_t  HFLBADDR;                          /*!< (@ 0x5004041C) Host Frame List Base Address Register                  */
  __I  uint32_t  RESERVED5[8];
  __IO uint32_t  HPRT;                              /*!< (@ 0x50040440) Host Port Control and Status Register                  */
  __I  uint32_t  RESERVED6[239];
  __IO uint32_t  DCFG;                              /*!< (@ 0x50040800) Device Configuration Register                          */
  __IO uint32_t  DCTL;                              /*!< (@ 0x50040804) Device Control Register                                */
  __I  uint32_t  DSTS;                              /*!< (@ 0x50040808) Device Status Register                                 */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  DIEPMSK;                           /*!< (@ 0x50040810) Device IN Endpoint Common Interrupt Mask Register      */
  __IO uint32_t  DOEPMSK;                           /*!< (@ 0x50040814) Device OUT Endpoint Common Interrupt Mask Register     */
  __I  uint32_t  DAINT;                             /*!< (@ 0x50040818) Device All Endpoints Interrupt Register                */
  __IO uint32_t  DAINTMSK;                          /*!< (@ 0x5004081C) Device All Endpoints Interrupt Mask Register           */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  DVBUSDIS;                          /*!< (@ 0x50040828) Device VBUS Discharge Time Register                    */
  __IO uint32_t  DVBUSPULSE;                        /*!< (@ 0x5004082C) Device VBUS Pulsing Time Register                      */
  __I  uint32_t  RESERVED9;
  __IO uint32_t  DIEPEMPMSK;                        /*!< (@ 0x50040834) Device IN Endpoint FIFO Empty Interrupt Mask
                                                         Register                                                              */
  __I  uint32_t  RESERVED10[370];
  __IO uint32_t  PCGCCTL;                           /*!< (@ 0x50040E00) Power and Clock Gating Control Register                */
} USB0_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                    USB0_EP0                    ================ */
/* ================================================================================ */


