alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4300_series/Include/XMC4300.h
/* ---------------------------  ECAT_MII_ECAT_ACS_STATE  -------------------------- */
#define ECAT_MII_ECAT_ACS_STATE_EN_ACS_MII_BY_PDI_Pos (0UL)             /*!< ECAT MII_ECAT_ACS_STATE: EN_ACS_MII_BY_PDI (Bit 0)          */
#define ECAT_MII_ECAT_ACS_STATE_EN_ACS_MII_BY_PDI_Msk (0x1UL)           /*!< ECAT MII_ECAT_ACS_STATE: EN_ACS_MII_BY_PDI (Bitfield-Mask: 0x01) */

/* ---------------------------  ECAT_MII_PDI_ACS_STATE  --------------------------- */
#define ECAT_MII_PDI_ACS_STATE_ACS_MII_BY_PDI_Pos (0UL)                 /*!< ECAT MII_PDI_ACS_STATE: ACS_MII_BY_PDI (Bit 0)              */
#define ECAT_MII_PDI_ACS_STATE_ACS_MII_BY_PDI_Msk (0x1UL)               /*!< ECAT MII_PDI_ACS_STATE: ACS_MII_BY_PDI (Bitfield-Mask: 0x01) */
#define ECAT_MII_PDI_ACS_STATE_FORCE_PDI_ACS_S_Pos (1UL)                /*!< ECAT MII_PDI_ACS_STATE: FORCE_PDI_ACS_S (Bit 1)             */
#define ECAT_MII_PDI_ACS_STATE_FORCE_PDI_ACS_S_Msk (0x2UL)              /*!< ECAT MII_PDI_ACS_STATE: FORCE_PDI_ACS_S (Bitfield-Mask: 0x01) */

/* ---------------------------  ECAT_DC_RCV_TIME_PORT0  --------------------------- */
#define ECAT_DC_RCV_TIME_PORT0_LOCAL_TIME_P0_Pos (0UL)                  /*!< ECAT DC_RCV_TIME_PORT0: LOCAL_TIME_P0 (Bit 0)               */
#define ECAT_DC_RCV_TIME_PORT0_LOCAL_TIME_P0_Msk (0xffffffffUL)         /*!< ECAT DC_RCV_TIME_PORT0: LOCAL_TIME_P0 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  ECAT_DC_RCV_TIME_PORT1  --------------------------- */
#define ECAT_DC_RCV_TIME_PORT1_LOCAL_TIME_P1_Pos (0UL)                  /*!< ECAT DC_RCV_TIME_PORT1: LOCAL_TIME_P1 (Bit 0)               */
#define ECAT_DC_RCV_TIME_PORT1_LOCAL_TIME_P1_Msk (0xffffffffUL)         /*!< ECAT DC_RCV_TIME_PORT1: LOCAL_TIME_P1 (Bitfield-Mask: 0xffffffff) */

/* ------------------------------  ECAT_DC_SYS_TIME  ------------------------------ */
#define ECAT_DC_SYS_TIME_WRITE_ACCESS_WRITEMode_Pos (0UL)               /*!< ECAT DC_SYS_TIME: WRITE_ACCESS_WRITEMode (Bit 0)            */
#define ECAT_DC_SYS_TIME_WRITE_ACCESS_WRITEMode_Msk (0xffffffffUL)      /*!< ECAT DC_SYS_TIME: WRITE_ACCESS_WRITEMode (Bitfield-Mask: 0xffffffff) */

/* ------------------------------  ECAT_DC_SYS_TIME  ------------------------------ */
#define ECAT_DC_SYS_TIME_READ_ACCESS_READMode_Pos (0UL)                 /*!< ECAT DC_SYS_TIME: READ_ACCESS_READMode (Bit 0)              */
#define ECAT_DC_SYS_TIME_READ_ACCESS_READMode_Msk (0xffffffffUL)        /*!< ECAT DC_SYS_TIME: READ_ACCESS_READMode (Bitfield-Mask: 0xffffffff) */

/* ----------------------------  ECAT_RECEIVE_TIME_PU  ---------------------------- */
#define ECAT_RECEIVE_TIME_PU_RECEIVE_TIME_PU_Pos (0UL)                  /*!< ECAT RECEIVE_TIME_PU: RECEIVE_TIME_PU (Bit 0)               */
#define ECAT_RECEIVE_TIME_PU_RECEIVE_TIME_PU_Msk (0xffffffffUL)         /*!< ECAT RECEIVE_TIME_PU: RECEIVE_TIME_PU (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  ECAT_DC_SYS_TIME_OFFSET  -------------------------- */
#define ECAT_DC_SYS_TIME_OFFSET_DC_SYS_TIME_OFFSET_Pos (0UL)            /*!< ECAT DC_SYS_TIME_OFFSET: DC_SYS_TIME_OFFSET (Bit 0)         */
#define ECAT_DC_SYS_TIME_OFFSET_DC_SYS_TIME_OFFSET_Msk (0xffffffffUL)   /*!< ECAT DC_SYS_TIME_OFFSET: DC_SYS_TIME_OFFSET (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  ECAT_DC_SYS_TIME_DELAY  --------------------------- */
#define ECAT_DC_SYS_TIME_DELAY_CLK_DELAY_Pos  (0UL)                     /*!< ECAT DC_SYS_TIME_DELAY: CLK_DELAY (Bit 0)                   */
#define ECAT_DC_SYS_TIME_DELAY_CLK_DELAY_Msk  (0xffffffffUL)            /*!< ECAT DC_SYS_TIME_DELAY: CLK_DELAY (Bitfield-Mask: 0xffffffff) */

/* ----------------------------  ECAT_DC_SYS_TIME_DIFF  --------------------------- */
#define ECAT_DC_SYS_TIME_DIFF_TIME_DIF_Pos    (0UL)                     /*!< ECAT DC_SYS_TIME_DIFF: TIME_DIF (Bit 0)                     */
#define ECAT_DC_SYS_TIME_DIFF_TIME_DIF_Msk    (0x7fffffffUL)            /*!< ECAT DC_SYS_TIME_DIFF: TIME_DIF (Bitfield-Mask: 0x7fffffff) */
#define ECAT_DC_SYS_TIME_DIFF_CPY_Pos         (31UL)                    /*!< ECAT DC_SYS_TIME_DIFF: CPY (Bit 31)                         */
#define ECAT_DC_SYS_TIME_DIFF_CPY_Msk         (0x80000000UL)            /*!< ECAT DC_SYS_TIME_DIFF: CPY (Bitfield-Mask: 0x01)            */

/* --------------------------  ECAT_DC_SPEED_COUNT_START  ------------------------- */
#define ECAT_DC_SPEED_COUNT_START_COUNT_START_Pos (0UL)                 /*!< ECAT DC_SPEED_COUNT_START: COUNT_START (Bit 0)              */
#define ECAT_DC_SPEED_COUNT_START_COUNT_START_Msk (0x7fffUL)            /*!< ECAT DC_SPEED_COUNT_START: COUNT_START (Bitfield-Mask: 0x7fff) */

/* --------------------------  ECAT_DC_SPEED_COUNT_DIFF  -------------------------- */
#define ECAT_DC_SPEED_COUNT_DIFF_DEVIATION_Pos (0UL)                    /*!< ECAT DC_SPEED_COUNT_DIFF: DEVIATION (Bit 0)                 */
#define ECAT_DC_SPEED_COUNT_DIFF_DEVIATION_Msk (0xffffUL)               /*!< ECAT DC_SPEED_COUNT_DIFF: DEVIATION (Bitfield-Mask: 0xffff) */

/* -------------------------  ECAT_DC_SYS_TIME_FIL_DEPTH  ------------------------- */
#define ECAT_DC_SYS_TIME_FIL_DEPTH_FILTER_DEPTH_Pos (0UL)               /*!< ECAT DC_SYS_TIME_FIL_DEPTH: FILTER_DEPTH (Bit 0)            */
#define ECAT_DC_SYS_TIME_FIL_DEPTH_FILTER_DEPTH_Msk (0xfUL)             /*!< ECAT DC_SYS_TIME_FIL_DEPTH: FILTER_DEPTH (Bitfield-Mask: 0x0f) */

/* ------------------------  ECAT_DC_SPEED_COUNT_FIL_DEPTH  ----------------------- */
#define ECAT_DC_SPEED_COUNT_FIL_DEPTH_FILTER_DEPTH_Pos (0UL)            /*!< ECAT DC_SPEED_COUNT_FIL_DEPTH: FILTER_DEPTH (Bit 0)         */
#define ECAT_DC_SPEED_COUNT_FIL_DEPTH_FILTER_DEPTH_Msk (0xfUL)          /*!< ECAT DC_SPEED_COUNT_FIL_DEPTH: FILTER_DEPTH (Bitfield-Mask: 0x0f) */

/* ------------------------------  ECAT_DC_CYC_CONT  ------------------------------ */
#define ECAT_DC_CYC_CONT_SYNC_Pos             (0UL)                     /*!< ECAT DC_CYC_CONT: SYNC (Bit 0)                              */
#define ECAT_DC_CYC_CONT_SYNC_Msk             (0x1UL)                   /*!< ECAT DC_CYC_CONT: SYNC (Bitfield-Mask: 0x01)                */
#define ECAT_DC_CYC_CONT_LATCH_U0_Pos         (4UL)                     /*!< ECAT DC_CYC_CONT: LATCH_U0 (Bit 4)                          */
#define ECAT_DC_CYC_CONT_LATCH_U0_Msk         (0x10UL)                  /*!< ECAT DC_CYC_CONT: LATCH_U0 (Bitfield-Mask: 0x01)            */
#define ECAT_DC_CYC_CONT_LATCH_U1_Pos         (5UL)                     /*!< ECAT DC_CYC_CONT: LATCH_U1 (Bit 5)                          */
#define ECAT_DC_CYC_CONT_LATCH_U1_Msk         (0x20UL)                  /*!< ECAT DC_CYC_CONT: LATCH_U1 (Bitfield-Mask: 0x01)            */

