alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4300_series/Include/XMC4300.h
/* ----------------------------  USB_GINTMSK_HOSTMODE  ---------------------------- */
#define USB_GINTMSK_HOSTMODE_ModeMisMsk_Pos   (1UL)                     /*!< USB GINTMSK_HOSTMODE: ModeMisMsk (Bit 1)                    */
#define USB_GINTMSK_HOSTMODE_ModeMisMsk_Msk   (0x2UL)                   /*!< USB GINTMSK_HOSTMODE: ModeMisMsk (Bitfield-Mask: 0x01)      */
#define USB_GINTMSK_HOSTMODE_OTGIntMsk_Pos    (2UL)                     /*!< USB GINTMSK_HOSTMODE: OTGIntMsk (Bit 2)                     */
#define USB_GINTMSK_HOSTMODE_OTGIntMsk_Msk    (0x4UL)                   /*!< USB GINTMSK_HOSTMODE: OTGIntMsk (Bitfield-Mask: 0x01)       */
#define USB_GINTMSK_HOSTMODE_SofMsk_Pos       (3UL)                     /*!< USB GINTMSK_HOSTMODE: SofMsk (Bit 3)                        */
#define USB_GINTMSK_HOSTMODE_SofMsk_Msk       (0x8UL)                   /*!< USB GINTMSK_HOSTMODE: SofMsk (Bitfield-Mask: 0x01)          */
#define USB_GINTMSK_HOSTMODE_RxFLvlMsk_Pos    (4UL)                     /*!< USB GINTMSK_HOSTMODE: RxFLvlMsk (Bit 4)                     */
#define USB_GINTMSK_HOSTMODE_RxFLvlMsk_Msk    (0x10UL)                  /*!< USB GINTMSK_HOSTMODE: RxFLvlMsk (Bitfield-Mask: 0x01)       */
#define USB_GINTMSK_HOSTMODE_incomplPMsk_Pos  (21UL)                    /*!< USB GINTMSK_HOSTMODE: incomplPMsk (Bit 21)                  */
#define USB_GINTMSK_HOSTMODE_incomplPMsk_Msk  (0x200000UL)              /*!< USB GINTMSK_HOSTMODE: incomplPMsk (Bitfield-Mask: 0x01)     */
#define USB_GINTMSK_HOSTMODE_PrtIntMsk_Pos    (24UL)                    /*!< USB GINTMSK_HOSTMODE: PrtIntMsk (Bit 24)                    */
#define USB_GINTMSK_HOSTMODE_PrtIntMsk_Msk    (0x1000000UL)             /*!< USB GINTMSK_HOSTMODE: PrtIntMsk (Bitfield-Mask: 0x01)       */
#define USB_GINTMSK_HOSTMODE_HChIntMsk_Pos    (25UL)                    /*!< USB GINTMSK_HOSTMODE: HChIntMsk (Bit 25)                    */
#define USB_GINTMSK_HOSTMODE_HChIntMsk_Msk    (0x2000000UL)             /*!< USB GINTMSK_HOSTMODE: HChIntMsk (Bitfield-Mask: 0x01)       */
#define USB_GINTMSK_HOSTMODE_PTxFEmpMsk_Pos   (26UL)                    /*!< USB GINTMSK_HOSTMODE: PTxFEmpMsk (Bit 26)                   */
#define USB_GINTMSK_HOSTMODE_PTxFEmpMsk_Msk   (0x4000000UL)             /*!< USB GINTMSK_HOSTMODE: PTxFEmpMsk (Bitfield-Mask: 0x01)      */
#define USB_GINTMSK_HOSTMODE_ConIDStsChngMsk_Pos (28UL)                 /*!< USB GINTMSK_HOSTMODE: ConIDStsChngMsk (Bit 28)              */
#define USB_GINTMSK_HOSTMODE_ConIDStsChngMsk_Msk (0x10000000UL)         /*!< USB GINTMSK_HOSTMODE: ConIDStsChngMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_HOSTMODE_DisconnIntMsk_Pos (29UL)                   /*!< USB GINTMSK_HOSTMODE: DisconnIntMsk (Bit 29)                */
#define USB_GINTMSK_HOSTMODE_DisconnIntMsk_Msk (0x20000000UL)           /*!< USB GINTMSK_HOSTMODE: DisconnIntMsk (Bitfield-Mask: 0x01)   */
#define USB_GINTMSK_HOSTMODE_SessReqIntMsk_Pos (30UL)                   /*!< USB GINTMSK_HOSTMODE: SessReqIntMsk (Bit 30)                */
#define USB_GINTMSK_HOSTMODE_SessReqIntMsk_Msk (0x40000000UL)           /*!< USB GINTMSK_HOSTMODE: SessReqIntMsk (Bitfield-Mask: 0x01)   */
#define USB_GINTMSK_HOSTMODE_WkUpIntMsk_Pos   (31UL)                    /*!< USB GINTMSK_HOSTMODE: WkUpIntMsk (Bit 31)                   */
#define USB_GINTMSK_HOSTMODE_WkUpIntMsk_Msk   (0x80000000UL)            /*!< USB GINTMSK_HOSTMODE: WkUpIntMsk (Bitfield-Mask: 0x01)      */

/* ---------------------------  USB_GINTMSK_DEVICEMODE  --------------------------- */
#define USB_GINTMSK_DEVICEMODE_ModeMisMsk_Pos (1UL)                     /*!< USB GINTMSK_DEVICEMODE: ModeMisMsk (Bit 1)                  */
#define USB_GINTMSK_DEVICEMODE_ModeMisMsk_Msk (0x2UL)                   /*!< USB GINTMSK_DEVICEMODE: ModeMisMsk (Bitfield-Mask: 0x01)    */
#define USB_GINTMSK_DEVICEMODE_OTGIntMsk_Pos  (2UL)                     /*!< USB GINTMSK_DEVICEMODE: OTGIntMsk (Bit 2)                   */
#define USB_GINTMSK_DEVICEMODE_OTGIntMsk_Msk  (0x4UL)                   /*!< USB GINTMSK_DEVICEMODE: OTGIntMsk (Bitfield-Mask: 0x01)     */
#define USB_GINTMSK_DEVICEMODE_SofMsk_Pos     (3UL)                     /*!< USB GINTMSK_DEVICEMODE: SofMsk (Bit 3)                      */
#define USB_GINTMSK_DEVICEMODE_SofMsk_Msk     (0x8UL)                   /*!< USB GINTMSK_DEVICEMODE: SofMsk (Bitfield-Mask: 0x01)        */
#define USB_GINTMSK_DEVICEMODE_RxFLvlMsk_Pos  (4UL)                     /*!< USB GINTMSK_DEVICEMODE: RxFLvlMsk (Bit 4)                   */
#define USB_GINTMSK_DEVICEMODE_RxFLvlMsk_Msk  (0x10UL)                  /*!< USB GINTMSK_DEVICEMODE: RxFLvlMsk (Bitfield-Mask: 0x01)     */
#define USB_GINTMSK_DEVICEMODE_GINNakEffMsk_Pos (6UL)                   /*!< USB GINTMSK_DEVICEMODE: GINNakEffMsk (Bit 6)                */
#define USB_GINTMSK_DEVICEMODE_GINNakEffMsk_Msk (0x40UL)                /*!< USB GINTMSK_DEVICEMODE: GINNakEffMsk (Bitfield-Mask: 0x01)  */
#define USB_GINTMSK_DEVICEMODE_GOUTNakEffMsk_Pos (7UL)                  /*!< USB GINTMSK_DEVICEMODE: GOUTNakEffMsk (Bit 7)               */
#define USB_GINTMSK_DEVICEMODE_GOUTNakEffMsk_Msk (0x80UL)               /*!< USB GINTMSK_DEVICEMODE: GOUTNakEffMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_ErlySuspMsk_Pos (10UL)                   /*!< USB GINTMSK_DEVICEMODE: ErlySuspMsk (Bit 10)                */
#define USB_GINTMSK_DEVICEMODE_ErlySuspMsk_Msk (0x400UL)                /*!< USB GINTMSK_DEVICEMODE: ErlySuspMsk (Bitfield-Mask: 0x01)   */
#define USB_GINTMSK_DEVICEMODE_USBSuspMsk_Pos (11UL)                    /*!< USB GINTMSK_DEVICEMODE: USBSuspMsk (Bit 11)                 */
#define USB_GINTMSK_DEVICEMODE_USBSuspMsk_Msk (0x800UL)                 /*!< USB GINTMSK_DEVICEMODE: USBSuspMsk (Bitfield-Mask: 0x01)    */
#define USB_GINTMSK_DEVICEMODE_USBRstMsk_Pos  (12UL)                    /*!< USB GINTMSK_DEVICEMODE: USBRstMsk (Bit 12)                  */
#define USB_GINTMSK_DEVICEMODE_USBRstMsk_Msk  (0x1000UL)                /*!< USB GINTMSK_DEVICEMODE: USBRstMsk (Bitfield-Mask: 0x01)     */
#define USB_GINTMSK_DEVICEMODE_EnumDoneMsk_Pos (13UL)                   /*!< USB GINTMSK_DEVICEMODE: EnumDoneMsk (Bit 13)                */
#define USB_GINTMSK_DEVICEMODE_EnumDoneMsk_Msk (0x2000UL)               /*!< USB GINTMSK_DEVICEMODE: EnumDoneMsk (Bitfield-Mask: 0x01)   */
#define USB_GINTMSK_DEVICEMODE_ISOOutDropMsk_Pos (14UL)                 /*!< USB GINTMSK_DEVICEMODE: ISOOutDropMsk (Bit 14)              */
#define USB_GINTMSK_DEVICEMODE_ISOOutDropMsk_Msk (0x4000UL)             /*!< USB GINTMSK_DEVICEMODE: ISOOutDropMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_EOPFMsk_Pos    (15UL)                    /*!< USB GINTMSK_DEVICEMODE: EOPFMsk (Bit 15)                    */
#define USB_GINTMSK_DEVICEMODE_EOPFMsk_Msk    (0x8000UL)                /*!< USB GINTMSK_DEVICEMODE: EOPFMsk (Bitfield-Mask: 0x01)       */
#define USB_GINTMSK_DEVICEMODE_IEPIntMsk_Pos  (18UL)                    /*!< USB GINTMSK_DEVICEMODE: IEPIntMsk (Bit 18)                  */
#define USB_GINTMSK_DEVICEMODE_IEPIntMsk_Msk  (0x40000UL)               /*!< USB GINTMSK_DEVICEMODE: IEPIntMsk (Bitfield-Mask: 0x01)     */
#define USB_GINTMSK_DEVICEMODE_OEPIntMsk_Pos  (19UL)                    /*!< USB GINTMSK_DEVICEMODE: OEPIntMsk (Bit 19)                  */
#define USB_GINTMSK_DEVICEMODE_OEPIntMsk_Msk  (0x80000UL)               /*!< USB GINTMSK_DEVICEMODE: OEPIntMsk (Bitfield-Mask: 0x01)     */
#define USB_GINTMSK_DEVICEMODE_incompISOINMsk_Pos (20UL)                /*!< USB GINTMSK_DEVICEMODE: incompISOINMsk (Bit 20)             */
#define USB_GINTMSK_DEVICEMODE_incompISOINMsk_Msk (0x100000UL)          /*!< USB GINTMSK_DEVICEMODE: incompISOINMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_incomplSOOUTMsk_Pos (21UL)               /*!< USB GINTMSK_DEVICEMODE: incomplSOOUTMsk (Bit 21)            */
#define USB_GINTMSK_DEVICEMODE_incomplSOOUTMsk_Msk (0x200000UL)         /*!< USB GINTMSK_DEVICEMODE: incomplSOOUTMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_ConIDStsChngMsk_Pos (28UL)               /*!< USB GINTMSK_DEVICEMODE: ConIDStsChngMsk (Bit 28)            */
#define USB_GINTMSK_DEVICEMODE_ConIDStsChngMsk_Msk (0x10000000UL)       /*!< USB GINTMSK_DEVICEMODE: ConIDStsChngMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_DisconnIntMsk_Pos (29UL)                 /*!< USB GINTMSK_DEVICEMODE: DisconnIntMsk (Bit 29)              */
#define USB_GINTMSK_DEVICEMODE_DisconnIntMsk_Msk (0x20000000UL)         /*!< USB GINTMSK_DEVICEMODE: DisconnIntMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_SessReqIntMsk_Pos (30UL)                 /*!< USB GINTMSK_DEVICEMODE: SessReqIntMsk (Bit 30)              */
#define USB_GINTMSK_DEVICEMODE_SessReqIntMsk_Msk (0x40000000UL)         /*!< USB GINTMSK_DEVICEMODE: SessReqIntMsk (Bitfield-Mask: 0x01) */
#define USB_GINTMSK_DEVICEMODE_WkUpIntMsk_Pos (31UL)                    /*!< USB GINTMSK_DEVICEMODE: WkUpIntMsk (Bit 31)                 */
#define USB_GINTMSK_DEVICEMODE_WkUpIntMsk_Msk (0x80000000UL)            /*!< USB GINTMSK_DEVICEMODE: WkUpIntMsk (Bitfield-Mask: 0x01)    */

/* ----------------------------  USB_GRXSTSR_HOSTMODE  ---------------------------- */
#define USB_GRXSTSR_HOSTMODE_ChNum_Pos        (0UL)                     /*!< USB GRXSTSR_HOSTMODE: ChNum (Bit 0)                         */
#define USB_GRXSTSR_HOSTMODE_ChNum_Msk        (0xfUL)                   /*!< USB GRXSTSR_HOSTMODE: ChNum (Bitfield-Mask: 0x0f)           */
#define USB_GRXSTSR_HOSTMODE_BCnt_Pos         (4UL)                     /*!< USB GRXSTSR_HOSTMODE: BCnt (Bit 4)                          */
#define USB_GRXSTSR_HOSTMODE_BCnt_Msk         (0x7ff0UL)                /*!< USB GRXSTSR_HOSTMODE: BCnt (Bitfield-Mask: 0x7ff)           */
#define USB_GRXSTSR_HOSTMODE_DPID_Pos         (15UL)                    /*!< USB GRXSTSR_HOSTMODE: DPID (Bit 15)                         */
#define USB_GRXSTSR_HOSTMODE_DPID_Msk         (0x18000UL)               /*!< USB GRXSTSR_HOSTMODE: DPID (Bitfield-Mask: 0x03)            */
#define USB_GRXSTSR_HOSTMODE_PktSts_Pos       (17UL)                    /*!< USB GRXSTSR_HOSTMODE: PktSts (Bit 17)                       */
#define USB_GRXSTSR_HOSTMODE_PktSts_Msk       (0x1e0000UL)              /*!< USB GRXSTSR_HOSTMODE: PktSts (Bitfield-Mask: 0x0f)          */

/* ---------------------------  USB_GRXSTSR_DEVICEMODE  --------------------------- */
#define USB_GRXSTSR_DEVICEMODE_EPNum_Pos      (0UL)                     /*!< USB GRXSTSR_DEVICEMODE: EPNum (Bit 0)                       */
#define USB_GRXSTSR_DEVICEMODE_EPNum_Msk      (0xfUL)                   /*!< USB GRXSTSR_DEVICEMODE: EPNum (Bitfield-Mask: 0x0f)         */
#define USB_GRXSTSR_DEVICEMODE_BCnt_Pos       (4UL)                     /*!< USB GRXSTSR_DEVICEMODE: BCnt (Bit 4)                        */
#define USB_GRXSTSR_DEVICEMODE_BCnt_Msk       (0x7ff0UL)                /*!< USB GRXSTSR_DEVICEMODE: BCnt (Bitfield-Mask: 0x7ff)         */
#define USB_GRXSTSR_DEVICEMODE_DPID_Pos       (15UL)                    /*!< USB GRXSTSR_DEVICEMODE: DPID (Bit 15)                       */
#define USB_GRXSTSR_DEVICEMODE_DPID_Msk       (0x18000UL)               /*!< USB GRXSTSR_DEVICEMODE: DPID (Bitfield-Mask: 0x03)          */
#define USB_GRXSTSR_DEVICEMODE_PktSts_Pos     (17UL)                    /*!< USB GRXSTSR_DEVICEMODE: PktSts (Bit 17)                     */
#define USB_GRXSTSR_DEVICEMODE_PktSts_Msk     (0x1e0000UL)              /*!< USB GRXSTSR_DEVICEMODE: PktSts (Bitfield-Mask: 0x0f)        */
#define USB_GRXSTSR_DEVICEMODE_FN_Pos         (21UL)                    /*!< USB GRXSTSR_DEVICEMODE: FN (Bit 21)                         */
#define USB_GRXSTSR_DEVICEMODE_FN_Msk         (0x1e00000UL)             /*!< USB GRXSTSR_DEVICEMODE: FN (Bitfield-Mask: 0x0f)            */

/* ---------------------------  USB_GRXSTSP_DEVICEMODE  --------------------------- */
#define USB_GRXSTSP_DEVICEMODE_EPNum_Pos      (0UL)                     /*!< USB GRXSTSP_DEVICEMODE: EPNum (Bit 0)                       */
#define USB_GRXSTSP_DEVICEMODE_EPNum_Msk      (0xfUL)                   /*!< USB GRXSTSP_DEVICEMODE: EPNum (Bitfield-Mask: 0x0f)         */
#define USB_GRXSTSP_DEVICEMODE_BCnt_Pos       (4UL)                     /*!< USB GRXSTSP_DEVICEMODE: BCnt (Bit 4)                        */
#define USB_GRXSTSP_DEVICEMODE_BCnt_Msk       (0x7ff0UL)                /*!< USB GRXSTSP_DEVICEMODE: BCnt (Bitfield-Mask: 0x7ff)         */
#define USB_GRXSTSP_DEVICEMODE_DPID_Pos       (15UL)                    /*!< USB GRXSTSP_DEVICEMODE: DPID (Bit 15)                       */
#define USB_GRXSTSP_DEVICEMODE_DPID_Msk       (0x18000UL)               /*!< USB GRXSTSP_DEVICEMODE: DPID (Bitfield-Mask: 0x03)          */
#define USB_GRXSTSP_DEVICEMODE_PktSts_Pos     (17UL)                    /*!< USB GRXSTSP_DEVICEMODE: PktSts (Bit 17)                     */
#define USB_GRXSTSP_DEVICEMODE_PktSts_Msk     (0x1e0000UL)              /*!< USB GRXSTSP_DEVICEMODE: PktSts (Bitfield-Mask: 0x0f)        */
#define USB_GRXSTSP_DEVICEMODE_FN_Pos         (21UL)                    /*!< USB GRXSTSP_DEVICEMODE: FN (Bit 21)                         */
#define USB_GRXSTSP_DEVICEMODE_FN_Msk         (0x1e00000UL)             /*!< USB GRXSTSP_DEVICEMODE: FN (Bitfield-Mask: 0x0f)            */

