alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4300_series/Include/XMC4300.h
/* ----------------------------------  PORT4_OMR  --------------------------------- */
#define PORT4_OMR_PS0_Pos                     (0UL)                     /*!< PORT4 OMR: PS0 (Bit 0)                                      */
#define PORT4_OMR_PS0_Msk                     (0x1UL)                   /*!< PORT4 OMR: PS0 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS1_Pos                     (1UL)                     /*!< PORT4 OMR: PS1 (Bit 1)                                      */
#define PORT4_OMR_PS1_Msk                     (0x2UL)                   /*!< PORT4 OMR: PS1 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS2_Pos                     (2UL)                     /*!< PORT4 OMR: PS2 (Bit 2)                                      */
#define PORT4_OMR_PS2_Msk                     (0x4UL)                   /*!< PORT4 OMR: PS2 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS3_Pos                     (3UL)                     /*!< PORT4 OMR: PS3 (Bit 3)                                      */
#define PORT4_OMR_PS3_Msk                     (0x8UL)                   /*!< PORT4 OMR: PS3 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS4_Pos                     (4UL)                     /*!< PORT4 OMR: PS4 (Bit 4)                                      */
#define PORT4_OMR_PS4_Msk                     (0x10UL)                  /*!< PORT4 OMR: PS4 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS5_Pos                     (5UL)                     /*!< PORT4 OMR: PS5 (Bit 5)                                      */
#define PORT4_OMR_PS5_Msk                     (0x20UL)                  /*!< PORT4 OMR: PS5 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS6_Pos                     (6UL)                     /*!< PORT4 OMR: PS6 (Bit 6)                                      */
#define PORT4_OMR_PS6_Msk                     (0x40UL)                  /*!< PORT4 OMR: PS6 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS7_Pos                     (7UL)                     /*!< PORT4 OMR: PS7 (Bit 7)                                      */
#define PORT4_OMR_PS7_Msk                     (0x80UL)                  /*!< PORT4 OMR: PS7 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS8_Pos                     (8UL)                     /*!< PORT4 OMR: PS8 (Bit 8)                                      */
#define PORT4_OMR_PS8_Msk                     (0x100UL)                 /*!< PORT4 OMR: PS8 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS9_Pos                     (9UL)                     /*!< PORT4 OMR: PS9 (Bit 9)                                      */
#define PORT4_OMR_PS9_Msk                     (0x200UL)                 /*!< PORT4 OMR: PS9 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PS10_Pos                    (10UL)                    /*!< PORT4 OMR: PS10 (Bit 10)                                    */
#define PORT4_OMR_PS10_Msk                    (0x400UL)                 /*!< PORT4 OMR: PS10 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PS11_Pos                    (11UL)                    /*!< PORT4 OMR: PS11 (Bit 11)                                    */
#define PORT4_OMR_PS11_Msk                    (0x800UL)                 /*!< PORT4 OMR: PS11 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PS12_Pos                    (12UL)                    /*!< PORT4 OMR: PS12 (Bit 12)                                    */
#define PORT4_OMR_PS12_Msk                    (0x1000UL)                /*!< PORT4 OMR: PS12 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PS13_Pos                    (13UL)                    /*!< PORT4 OMR: PS13 (Bit 13)                                    */
#define PORT4_OMR_PS13_Msk                    (0x2000UL)                /*!< PORT4 OMR: PS13 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PS14_Pos                    (14UL)                    /*!< PORT4 OMR: PS14 (Bit 14)                                    */
#define PORT4_OMR_PS14_Msk                    (0x4000UL)                /*!< PORT4 OMR: PS14 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PS15_Pos                    (15UL)                    /*!< PORT4 OMR: PS15 (Bit 15)                                    */
#define PORT4_OMR_PS15_Msk                    (0x8000UL)                /*!< PORT4 OMR: PS15 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PR0_Pos                     (16UL)                    /*!< PORT4 OMR: PR0 (Bit 16)                                     */
#define PORT4_OMR_PR0_Msk                     (0x10000UL)               /*!< PORT4 OMR: PR0 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR1_Pos                     (17UL)                    /*!< PORT4 OMR: PR1 (Bit 17)                                     */
#define PORT4_OMR_PR1_Msk                     (0x20000UL)               /*!< PORT4 OMR: PR1 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR2_Pos                     (18UL)                    /*!< PORT4 OMR: PR2 (Bit 18)                                     */
#define PORT4_OMR_PR2_Msk                     (0x40000UL)               /*!< PORT4 OMR: PR2 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR3_Pos                     (19UL)                    /*!< PORT4 OMR: PR3 (Bit 19)                                     */
#define PORT4_OMR_PR3_Msk                     (0x80000UL)               /*!< PORT4 OMR: PR3 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR4_Pos                     (20UL)                    /*!< PORT4 OMR: PR4 (Bit 20)                                     */
#define PORT4_OMR_PR4_Msk                     (0x100000UL)              /*!< PORT4 OMR: PR4 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR5_Pos                     (21UL)                    /*!< PORT4 OMR: PR5 (Bit 21)                                     */
#define PORT4_OMR_PR5_Msk                     (0x200000UL)              /*!< PORT4 OMR: PR5 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR6_Pos                     (22UL)                    /*!< PORT4 OMR: PR6 (Bit 22)                                     */
#define PORT4_OMR_PR6_Msk                     (0x400000UL)              /*!< PORT4 OMR: PR6 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR7_Pos                     (23UL)                    /*!< PORT4 OMR: PR7 (Bit 23)                                     */
#define PORT4_OMR_PR7_Msk                     (0x800000UL)              /*!< PORT4 OMR: PR7 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR8_Pos                     (24UL)                    /*!< PORT4 OMR: PR8 (Bit 24)                                     */
#define PORT4_OMR_PR8_Msk                     (0x1000000UL)             /*!< PORT4 OMR: PR8 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR9_Pos                     (25UL)                    /*!< PORT4 OMR: PR9 (Bit 25)                                     */
#define PORT4_OMR_PR9_Msk                     (0x2000000UL)             /*!< PORT4 OMR: PR9 (Bitfield-Mask: 0x01)                        */
#define PORT4_OMR_PR10_Pos                    (26UL)                    /*!< PORT4 OMR: PR10 (Bit 26)                                    */
#define PORT4_OMR_PR10_Msk                    (0x4000000UL)             /*!< PORT4 OMR: PR10 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PR11_Pos                    (27UL)                    /*!< PORT4 OMR: PR11 (Bit 27)                                    */
#define PORT4_OMR_PR11_Msk                    (0x8000000UL)             /*!< PORT4 OMR: PR11 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PR12_Pos                    (28UL)                    /*!< PORT4 OMR: PR12 (Bit 28)                                    */
#define PORT4_OMR_PR12_Msk                    (0x10000000UL)            /*!< PORT4 OMR: PR12 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PR13_Pos                    (29UL)                    /*!< PORT4 OMR: PR13 (Bit 29)                                    */
#define PORT4_OMR_PR13_Msk                    (0x20000000UL)            /*!< PORT4 OMR: PR13 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PR14_Pos                    (30UL)                    /*!< PORT4 OMR: PR14 (Bit 30)                                    */
#define PORT4_OMR_PR14_Msk                    (0x40000000UL)            /*!< PORT4 OMR: PR14 (Bitfield-Mask: 0x01)                       */
#define PORT4_OMR_PR15_Pos                    (31UL)                    /*!< PORT4 OMR: PR15 (Bit 31)                                    */
#define PORT4_OMR_PR15_Msk                    (0x80000000UL)            /*!< PORT4 OMR: PR15 (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  PORT4_IOCR0  -------------------------------- */
#define PORT4_IOCR0_PC0_Pos                   (3UL)                     /*!< PORT4 IOCR0: PC0 (Bit 3)                                    */
#define PORT4_IOCR0_PC0_Msk                   (0xf8UL)                  /*!< PORT4 IOCR0: PC0 (Bitfield-Mask: 0x1f)                      */
#define PORT4_IOCR0_PC1_Pos                   (11UL)                    /*!< PORT4 IOCR0: PC1 (Bit 11)                                   */
#define PORT4_IOCR0_PC1_Msk                   (0xf800UL)                /*!< PORT4 IOCR0: PC1 (Bitfield-Mask: 0x1f)                      */
#define PORT4_IOCR0_PC2_Pos                   (19UL)                    /*!< PORT4 IOCR0: PC2 (Bit 19)                                   */
#define PORT4_IOCR0_PC2_Msk                   (0xf80000UL)              /*!< PORT4 IOCR0: PC2 (Bitfield-Mask: 0x1f)                      */
#define PORT4_IOCR0_PC3_Pos                   (27UL)                    /*!< PORT4 IOCR0: PC3 (Bit 27)                                   */
#define PORT4_IOCR0_PC3_Msk                   (0xf8000000UL)            /*!< PORT4 IOCR0: PC3 (Bitfield-Mask: 0x1f)                      */

/* ----------------------------------  PORT4_IN  ---------------------------------- */
#define PORT4_IN_P0_Pos                       (0UL)                     /*!< PORT4 IN: P0 (Bit 0)                                        */
#define PORT4_IN_P0_Msk                       (0x1UL)                   /*!< PORT4 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P1_Pos                       (1UL)                     /*!< PORT4 IN: P1 (Bit 1)                                        */
#define PORT4_IN_P1_Msk                       (0x2UL)                   /*!< PORT4 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P2_Pos                       (2UL)                     /*!< PORT4 IN: P2 (Bit 2)                                        */
#define PORT4_IN_P2_Msk                       (0x4UL)                   /*!< PORT4 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P3_Pos                       (3UL)                     /*!< PORT4 IN: P3 (Bit 3)                                        */
#define PORT4_IN_P3_Msk                       (0x8UL)                   /*!< PORT4 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P4_Pos                       (4UL)                     /*!< PORT4 IN: P4 (Bit 4)                                        */
#define PORT4_IN_P4_Msk                       (0x10UL)                  /*!< PORT4 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P5_Pos                       (5UL)                     /*!< PORT4 IN: P5 (Bit 5)                                        */
#define PORT4_IN_P5_Msk                       (0x20UL)                  /*!< PORT4 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P6_Pos                       (6UL)                     /*!< PORT4 IN: P6 (Bit 6)                                        */
#define PORT4_IN_P6_Msk                       (0x40UL)                  /*!< PORT4 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P7_Pos                       (7UL)                     /*!< PORT4 IN: P7 (Bit 7)                                        */
#define PORT4_IN_P7_Msk                       (0x80UL)                  /*!< PORT4 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P8_Pos                       (8UL)                     /*!< PORT4 IN: P8 (Bit 8)                                        */
#define PORT4_IN_P8_Msk                       (0x100UL)                 /*!< PORT4 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P9_Pos                       (9UL)                     /*!< PORT4 IN: P9 (Bit 9)                                        */
#define PORT4_IN_P9_Msk                       (0x200UL)                 /*!< PORT4 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P10_Pos                      (10UL)                    /*!< PORT4 IN: P10 (Bit 10)                                      */
#define PORT4_IN_P10_Msk                      (0x400UL)                 /*!< PORT4 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT4_IN_P11_Pos                      (11UL)                    /*!< PORT4 IN: P11 (Bit 11)                                      */
#define PORT4_IN_P11_Msk                      (0x800UL)                 /*!< PORT4 IN: P11 (Bitfield-Mask: 0x01)                         */
#define PORT4_IN_P12_Pos                      (12UL)                    /*!< PORT4 IN: P12 (Bit 12)                                      */
#define PORT4_IN_P12_Msk                      (0x1000UL)                /*!< PORT4 IN: P12 (Bitfield-Mask: 0x01)                         */
#define PORT4_IN_P13_Pos                      (13UL)                    /*!< PORT4 IN: P13 (Bit 13)                                      */
#define PORT4_IN_P13_Msk                      (0x2000UL)                /*!< PORT4 IN: P13 (Bitfield-Mask: 0x01)                         */
#define PORT4_IN_P14_Pos                      (14UL)                    /*!< PORT4 IN: P14 (Bit 14)                                      */
#define PORT4_IN_P14_Msk                      (0x4000UL)                /*!< PORT4 IN: P14 (Bitfield-Mask: 0x01)                         */
#define PORT4_IN_P15_Pos                      (15UL)                    /*!< PORT4 IN: P15 (Bit 15)                                      */
#define PORT4_IN_P15_Msk                      (0x8000UL)                /*!< PORT4 IN: P15 (Bitfield-Mask: 0x01)                         */

