alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4300_series/Include/XMC4300.h
/* ---------------------------------  PORT15_OMR  --------------------------------- */
#define PORT15_OMR_PS0_Pos                    (0UL)                     /*!< PORT15 OMR: PS0 (Bit 0)                                     */
#define PORT15_OMR_PS0_Msk                    (0x1UL)                   /*!< PORT15 OMR: PS0 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS1_Pos                    (1UL)                     /*!< PORT15 OMR: PS1 (Bit 1)                                     */
#define PORT15_OMR_PS1_Msk                    (0x2UL)                   /*!< PORT15 OMR: PS1 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS2_Pos                    (2UL)                     /*!< PORT15 OMR: PS2 (Bit 2)                                     */
#define PORT15_OMR_PS2_Msk                    (0x4UL)                   /*!< PORT15 OMR: PS2 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS3_Pos                    (3UL)                     /*!< PORT15 OMR: PS3 (Bit 3)                                     */
#define PORT15_OMR_PS3_Msk                    (0x8UL)                   /*!< PORT15 OMR: PS3 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS4_Pos                    (4UL)                     /*!< PORT15 OMR: PS4 (Bit 4)                                     */
#define PORT15_OMR_PS4_Msk                    (0x10UL)                  /*!< PORT15 OMR: PS4 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS5_Pos                    (5UL)                     /*!< PORT15 OMR: PS5 (Bit 5)                                     */
#define PORT15_OMR_PS5_Msk                    (0x20UL)                  /*!< PORT15 OMR: PS5 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS6_Pos                    (6UL)                     /*!< PORT15 OMR: PS6 (Bit 6)                                     */
#define PORT15_OMR_PS6_Msk                    (0x40UL)                  /*!< PORT15 OMR: PS6 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS7_Pos                    (7UL)                     /*!< PORT15 OMR: PS7 (Bit 7)                                     */
#define PORT15_OMR_PS7_Msk                    (0x80UL)                  /*!< PORT15 OMR: PS7 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS8_Pos                    (8UL)                     /*!< PORT15 OMR: PS8 (Bit 8)                                     */
#define PORT15_OMR_PS8_Msk                    (0x100UL)                 /*!< PORT15 OMR: PS8 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS9_Pos                    (9UL)                     /*!< PORT15 OMR: PS9 (Bit 9)                                     */
#define PORT15_OMR_PS9_Msk                    (0x200UL)                 /*!< PORT15 OMR: PS9 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PS10_Pos                   (10UL)                    /*!< PORT15 OMR: PS10 (Bit 10)                                   */
#define PORT15_OMR_PS10_Msk                   (0x400UL)                 /*!< PORT15 OMR: PS10 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PS11_Pos                   (11UL)                    /*!< PORT15 OMR: PS11 (Bit 11)                                   */
#define PORT15_OMR_PS11_Msk                   (0x800UL)                 /*!< PORT15 OMR: PS11 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PS12_Pos                   (12UL)                    /*!< PORT15 OMR: PS12 (Bit 12)                                   */
#define PORT15_OMR_PS12_Msk                   (0x1000UL)                /*!< PORT15 OMR: PS12 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PS13_Pos                   (13UL)                    /*!< PORT15 OMR: PS13 (Bit 13)                                   */
#define PORT15_OMR_PS13_Msk                   (0x2000UL)                /*!< PORT15 OMR: PS13 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PS14_Pos                   (14UL)                    /*!< PORT15 OMR: PS14 (Bit 14)                                   */
#define PORT15_OMR_PS14_Msk                   (0x4000UL)                /*!< PORT15 OMR: PS14 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PS15_Pos                   (15UL)                    /*!< PORT15 OMR: PS15 (Bit 15)                                   */
#define PORT15_OMR_PS15_Msk                   (0x8000UL)                /*!< PORT15 OMR: PS15 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PR0_Pos                    (16UL)                    /*!< PORT15 OMR: PR0 (Bit 16)                                    */
#define PORT15_OMR_PR0_Msk                    (0x10000UL)               /*!< PORT15 OMR: PR0 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR1_Pos                    (17UL)                    /*!< PORT15 OMR: PR1 (Bit 17)                                    */
#define PORT15_OMR_PR1_Msk                    (0x20000UL)               /*!< PORT15 OMR: PR1 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR2_Pos                    (18UL)                    /*!< PORT15 OMR: PR2 (Bit 18)                                    */
#define PORT15_OMR_PR2_Msk                    (0x40000UL)               /*!< PORT15 OMR: PR2 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR3_Pos                    (19UL)                    /*!< PORT15 OMR: PR3 (Bit 19)                                    */
#define PORT15_OMR_PR3_Msk                    (0x80000UL)               /*!< PORT15 OMR: PR3 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR4_Pos                    (20UL)                    /*!< PORT15 OMR: PR4 (Bit 20)                                    */
#define PORT15_OMR_PR4_Msk                    (0x100000UL)              /*!< PORT15 OMR: PR4 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR5_Pos                    (21UL)                    /*!< PORT15 OMR: PR5 (Bit 21)                                    */
#define PORT15_OMR_PR5_Msk                    (0x200000UL)              /*!< PORT15 OMR: PR5 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR6_Pos                    (22UL)                    /*!< PORT15 OMR: PR6 (Bit 22)                                    */
#define PORT15_OMR_PR6_Msk                    (0x400000UL)              /*!< PORT15 OMR: PR6 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR7_Pos                    (23UL)                    /*!< PORT15 OMR: PR7 (Bit 23)                                    */
#define PORT15_OMR_PR7_Msk                    (0x800000UL)              /*!< PORT15 OMR: PR7 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR8_Pos                    (24UL)                    /*!< PORT15 OMR: PR8 (Bit 24)                                    */
#define PORT15_OMR_PR8_Msk                    (0x1000000UL)             /*!< PORT15 OMR: PR8 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR9_Pos                    (25UL)                    /*!< PORT15 OMR: PR9 (Bit 25)                                    */
#define PORT15_OMR_PR9_Msk                    (0x2000000UL)             /*!< PORT15 OMR: PR9 (Bitfield-Mask: 0x01)                       */
#define PORT15_OMR_PR10_Pos                   (26UL)                    /*!< PORT15 OMR: PR10 (Bit 26)                                   */
#define PORT15_OMR_PR10_Msk                   (0x4000000UL)             /*!< PORT15 OMR: PR10 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PR11_Pos                   (27UL)                    /*!< PORT15 OMR: PR11 (Bit 27)                                   */
#define PORT15_OMR_PR11_Msk                   (0x8000000UL)             /*!< PORT15 OMR: PR11 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PR12_Pos                   (28UL)                    /*!< PORT15 OMR: PR12 (Bit 28)                                   */
#define PORT15_OMR_PR12_Msk                   (0x10000000UL)            /*!< PORT15 OMR: PR12 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PR13_Pos                   (29UL)                    /*!< PORT15 OMR: PR13 (Bit 29)                                   */
#define PORT15_OMR_PR13_Msk                   (0x20000000UL)            /*!< PORT15 OMR: PR13 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PR14_Pos                   (30UL)                    /*!< PORT15 OMR: PR14 (Bit 30)                                   */
#define PORT15_OMR_PR14_Msk                   (0x40000000UL)            /*!< PORT15 OMR: PR14 (Bitfield-Mask: 0x01)                      */
#define PORT15_OMR_PR15_Pos                   (31UL)                    /*!< PORT15 OMR: PR15 (Bit 31)                                   */
#define PORT15_OMR_PR15_Msk                   (0x80000000UL)            /*!< PORT15 OMR: PR15 (Bitfield-Mask: 0x01)                      */

