alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4300_series/Include/XMC4300.h
#define PPB                             ((PPB_Type                *) PPB_BASE)
#define DLR                             ((DLR_GLOBAL_TypeDef                *) DLR_BASE)
#define ERU0                            ((ERU_GLOBAL_TypeDef                *) ERU0_BASE)
#define ERU1                            ((ERU_GLOBAL_TypeDef                *) ERU1_BASE)
#define GPDMA0                          ((GPDMA0_GLOBAL_TypeDef             *) GPDMA0_BASE)
#define GPDMA0_CH0                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH0_BASE)
#define GPDMA0_CH1                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH1_BASE)
#define GPDMA0_CH2                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH2_BASE)
#define GPDMA0_CH3                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH3_BASE)
#define GPDMA0_CH4                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH4_BASE)
#define GPDMA0_CH5                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH5_BASE)
#define GPDMA0_CH6                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH6_BASE)
#define GPDMA0_CH7                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH7_BASE)
#define FCE                             ((FCE_GLOBAL_TypeDef                *) FCE_BASE)
#define FCE_KE0                         ((FCE_KE_TypeDef             *) FCE_KE0_BASE)
#define FCE_KE1                         ((FCE_KE_TypeDef             *) FCE_KE1_BASE)
#define FCE_KE2                         ((FCE_KE_TypeDef             *) FCE_KE2_BASE)
#define FCE_KE3                         ((FCE_KE_TypeDef             *) FCE_KE3_BASE)
#define PBA0                            ((PBA_GLOBAL_TypeDef                *) PBA0_BASE)
#define PBA1                            ((PBA_GLOBAL_TypeDef                *) PBA1_BASE)
#define FLASH0                          ((FLASH0_GLOBAL_TypeDef              *) FLASH0_BASE)
#define PREF                            ((PREF_GLOBAL_TypeDef               *) PREF_BASE)
#define PMU0                            ((PMU0_GLOBAL_TypeDef                *) PMU0_BASE)
#define WDT                             ((WDT_GLOBAL_TypeDef                *) WDT_BASE)
#define RTC                             ((RTC_GLOBAL_TypeDef                *) RTC_BASE)
#define SCU_CLK                         ((SCU_CLK_TypeDef            *) SCU_CLK_BASE)
#define SCU_OSC                         ((SCU_OSC_TypeDef            *) SCU_OSC_BASE)
#define SCU_PLL                         ((SCU_PLL_TypeDef            *) SCU_PLL_BASE)
#define SCU_GENERAL                     ((SCU_GENERAL_TypeDef        *) SCU_GENERAL_BASE)
#define SCU_INTERRUPT                   ((SCU_INTERRUPT_TypeDef      *) SCU_INTERRUPT_BASE)
#define SCU_PARITY                      ((SCU_PARITY_TypeDef         *) SCU_PARITY_BASE)
#define SCU_TRAP                        ((SCU_TRAP_TypeDef           *) SCU_TRAP_BASE)
#define SCU_HIBERNATE                   ((SCU_HIBERNATE_TypeDef      *) SCU_HIBERNATE_BASE)
#define SCU_POWER                       ((SCU_POWER_TypeDef          *) SCU_POWER_BASE)
#define SCU_RESET                       ((SCU_RESET_TypeDef          *) SCU_RESET_BASE)
#define LEDTS0                          ((LEDTS0_GLOBAL_TypeDef              *) LEDTS0_BASE)
#define SDMMC_CON                       ((SDMMC_CON_Type          *) SDMMC_CON_BASE)
#define SDMMC                           ((SDMMC_GLOBAL_TypeDef              *) SDMMC_BASE)
#define ETH0_CON                        ((ETH0_CON_GLOBAL_TypeDef           *) ETH0_CON_BASE)
#define ETH0                            ((ETH_GLOBAL_TypeDef                *) ETH0_BASE)
#define ECAT0_CON                       ((ECAT0_CON_Type          *) ECAT0_CON_BASE)
#define ECAT0                           ((ECAT_Type               *) ECAT0_BASE)
#define ECAT0_FMMU0                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU0_BASE)
#define ECAT0_FMMU1                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU1_BASE)
#define ECAT0_FMMU2                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU2_BASE)
#define ECAT0_FMMU3                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU3_BASE)
#define ECAT0_FMMU4                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU4_BASE)
#define ECAT0_FMMU5                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU5_BASE)
#define ECAT0_FMMU6                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU6_BASE)
#define ECAT0_FMMU7                     ((ECAT0_FMMU_Type         *) ECAT0_FMMU7_BASE)
#define ECAT0_SM0                       ((ECAT0_SM_Type           *) ECAT0_SM0_BASE)
#define ECAT0_SM1                       ((ECAT0_SM_Type           *) ECAT0_SM1_BASE)
#define ECAT0_SM2                       ((ECAT0_SM_Type           *) ECAT0_SM2_BASE)
#define ECAT0_SM3                       ((ECAT0_SM_Type           *) ECAT0_SM3_BASE)
#define ECAT0_SM4                       ((ECAT0_SM_Type           *) ECAT0_SM4_BASE)
#define ECAT0_SM5                       ((ECAT0_SM_Type           *) ECAT0_SM5_BASE)
#define ECAT0_SM6                       ((ECAT0_SM_Type           *) ECAT0_SM6_BASE)
#define ECAT0_SM7                       ((ECAT0_SM_Type           *) ECAT0_SM7_BASE)
#define USB0                            ((USB0_GLOBAL_TypeDef                *) USB0_BASE)
#define USB0_EP0                        ((USB0_EP0_TypeDef           *) USB_EP_BASE)
#define USB0_EP1                        ((USB0_EP_TypeDef             *) USB0_EP1_BASE)
#define USB0_EP2                        ((USB0_EP_TypeDef             *) USB0_EP2_BASE)
#define USB0_EP3                        ((USB0_EP_TypeDef             *) USB0_EP3_BASE)
#define USB0_EP4                        ((USB0_EP_TypeDef             *) USB0_EP4_BASE)
#define USB0_EP5                        ((USB0_EP_TypeDef             *) USB0_EP5_BASE)
#define USB0_EP6                        ((USB0_EP_TypeDef             *) USB0_EP6_BASE)
#define USB0_CH0                        ((USB0_CH_TypeDef             *) USB0_CH0_BASE)
#define USB0_CH1                        ((USB0_CH_TypeDef             *) USB0_CH1_BASE)
#define USB0_CH2                        ((USB0_CH_TypeDef             *) USB0_CH2_BASE)
#define USB0_CH3                        ((USB0_CH_TypeDef             *) USB0_CH3_BASE)
#define USB0_CH4                        ((USB0_CH_TypeDef             *) USB0_CH4_BASE)
#define USB0_CH5                        ((USB0_CH_TypeDef             *) USB0_CH5_BASE)
#define USB0_CH6                        ((USB0_CH_TypeDef             *) USB0_CH6_BASE)
#define USB0_CH7                        ((USB0_CH_TypeDef             *) USB0_CH7_BASE)
#define USB0_CH8                        ((USB0_CH_TypeDef             *) USB0_CH8_BASE)
#define USB0_CH9                        ((USB0_CH_TypeDef             *) USB0_CH9_BASE)
#define USB0_CH10                       ((USB0_CH_TypeDef             *) USB0_CH10_BASE)
#define USB0_CH11                       ((USB0_CH_TypeDef             *) USB0_CH11_BASE)
#define USB0_CH12                       ((USB0_CH_TypeDef             *) USB0_CH12_BASE)
#define USB0_CH13                       ((USB0_CH_TypeDef             *) USB0_CH13_BASE)
#define USIC0                           ((USIC_GLOBAL_TypeDef               *) USIC0_BASE)
#define USIC1                           ((USIC_GLOBAL_TypeDef               *) USIC1_BASE)
#define USIC0_CH0                       ((USIC_CH_TypeDef            *) USIC0_CH0_BASE)
#define USIC0_CH1                       ((USIC_CH_TypeDef            *) USIC0_CH1_BASE)
#define USIC1_CH0                       ((USIC_CH_TypeDef            *) USIC1_CH0_BASE)
#define USIC1_CH1                       ((USIC_CH_TypeDef            *) USIC1_CH1_BASE)
#define CAN                             ((CAN_GLOBAL_TypeDef                *) CAN_BASE)
#define CAN_NODE0                       ((CAN_NODE_TypeDef           *) CAN_NODE0_BASE)
#define CAN_NODE1                       ((CAN_NODE_TypeDef           *) CAN_NODE1_BASE)
#define CAN_MO                          ((CAN_MO_CLUSTER_Type     *) CAN_MO_BASE)
#define VADC                            ((VADC_GLOBAL_TypeDef               *) VADC_BASE)
#define VADC_G0                         ((VADC_G_TypeDef             *) VADC_G0_BASE)
#define VADC_G1                         ((VADC_G_TypeDef             *) VADC_G1_BASE)
#define DAC                             ((DAC_GLOBAL_TypeDef                *) DAC_BASE)
#define CCU40                           ((CCU4_GLOBAL_TypeDef               *) CCU40_BASE)
#define CCU41                           ((CCU4_GLOBAL_TypeDef               *) CCU41_BASE)
#define CCU40_CC40                      ((CCU4_CC4_TypeDef           *) CCU40_CC40_BASE)
#define CCU40_CC41                      ((CCU4_CC4_TypeDef           *) CCU40_CC41_BASE)
#define CCU40_CC42                      ((CCU4_CC4_TypeDef           *) CCU40_CC42_BASE)
#define CCU40_CC43                      ((CCU4_CC4_TypeDef           *) CCU40_CC43_BASE)
#define CCU41_CC40                      ((CCU4_CC4_TypeDef           *) CCU41_CC40_BASE)
#define CCU41_CC41                      ((CCU4_CC4_TypeDef           *) CCU41_CC41_BASE)
#define CCU41_CC42                      ((CCU4_CC4_TypeDef           *) CCU41_CC42_BASE)
#define CCU41_CC43                      ((CCU4_CC4_TypeDef           *) CCU41_CC43_BASE)
#define CCU80                           ((CCU8_GLOBAL_TypeDef               *) CCU80_BASE)
#define CCU80_CC80                      ((CCU8_CC8_TypeDef           *) CCU80_CC80_BASE)
#define CCU80_CC81                      ((CCU8_CC8_TypeDef           *) CCU80_CC81_BASE)
#define CCU80_CC82                      ((CCU8_CC8_TypeDef           *) CCU80_CC82_BASE)
#define CCU80_CC83                      ((CCU8_CC8_TypeDef           *) CCU80_CC83_BASE)
#define PORT0                           ((PORT0_Type              *) PORT0_BASE)
#define PORT1                           ((PORT1_Type              *) PORT1_BASE)
#define PORT2                           ((PORT2_Type              *) PORT2_BASE)
#define PORT3                           ((PORT3_Type              *) PORT3_BASE)
#define PORT4                           ((PORT4_Type              *) PORT4_BASE)
#define PORT5                           ((PORT5_Type              *) PORT5_BASE)
#define PORT14                          ((PORT14_Type             *) PORT14_BASE)
#define PORT15                          ((PORT15_Type             *) PORT15_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group XMC4300 */
/** @} */ /* End of group Infineon */

#ifdef __cplusplus
}
#endif


#endif  /* XMC4300_H */

